[
  {
    "title": "US airlines’ daily cancellations top 2,000 for first time since shutdown cuts began - AP News",
    "description": "U.S. airlines canceled more than 2,100 flights Sunday mostly because of the government shutdown and the Federal Aviation Administration’s order to reduce air traffic. The slowdown at 40 of the nation’s busiest airports is now in its third day and beginning to…",
    "url": "https://apnews.com/article/thanksgiving-air-traffic-shutdown-delays-ae216380cdf694c518bd2a4b0830eaea",
    "source": "Associated Press",
    "type": "Business"
  },
  {
    "title": "‘Shares Poised to Collapse,’ Says Investor About Palantir Stock - TipRanks",
    "description": "Another quarter, another strong showing from Palantir (NASDAQ:PLTR). The big data analytics firm continues to impress, notching record revenue, expanding profits, a...",
    "url": "https://www.tipranks.com/news/shares-poised-to-collapse-says-investor-about-palantir-stock",
    "source": "Tipranks.com",
    "type": "Business"
  },
  {
    "title": "Major burger chain is closing 300 stores next year - Yahoo Finance",
    "description": "The burger wars have always been fiercely fought, but the battle is even more challenging this year due to inflation and job losses. Prices are surging, and ...",
    "url": "https://www.thestreet.com/restaurants/major-burger-chain-is-closing-300-stores-next-year",
    "source": "TheStreet",
    "type": "Business"
  },
  {
    "title": "Walmart Black Friday 2025: The best early deals we could find on tech, home essentials and more - Yahoo",
    "description": "Enjoy major pre-holiday savings this week on home essentials, tech upgrades, gifting picks and more for up to 80% off.",
    "url": "https://www.yahoo.com/lifestyle/deals/article/walmart-black-friday-2025-the-best-early-deals-we-could-find-on-tech-home-essentials-and-more-180206619.html",
    "source": "Yahoo Entertainment",
    "type": "Business"
  },
  {
    "title": "We found the best Amazon Black Friday deals from Dyson, Apple and more — start shopping the biggest holiday sale early - Yahoo",
    "description": "The best Amazon sales will save you major bucks on everything from tech upgrades to holiday gift-worthy goodies.",
    "url": "https://www.yahoo.com/lifestyle/deals/article/we-found-the-best-amazon-black-friday-deals-from-dyson-apple-and-more--start-shopping-the-biggest-holiday-sale-early-174950115.html",
    "source": "Yahoo Entertainment",
    "type": "Business"
  },
  {
    "title": "Move over, 30-year mortgage. The Trump White House is working on a 50-year option to break the housing market gridlock - Fortune",
    "description": "FHFA Director Bill Pulte confirmed Saturday, “We are indeed working on The 50-year Mortgage – a complete game changer.\"",
    "url": "https://fortune.com/2025/11/09/housing-market-30-year-mortgage-trump-pulte-fhfa-50-year-option-home-affordability/",
    "source": "Fortune",
    "type": "Business"
  },
  {
    "title": "Officials warn of big hit to air travel and GDP as US government shutdown drags on - Financial Times",
    "description": "Trump administration says flights will slow to a ‘trickle’ with no end in sight to budget impasse",
    "url": "https://www.ft.com/content/8780f61f-e40d-4e5c-8867-49cdd75d29a7",
    "source": "Financial Times",
    "type": "Business"
  },
  {
    "title": "TechCrunch Mobility: Elon Musk’s threats worked - TechCrunch",
    "description": "Welcome back to TechCrunch Mobility, your hub for all things “future of transportation.”",
    "url": "https://techcrunch.com/2025/11/09/techcrunch-mobility-elon-musks-threats-worked/",
    "source": "TechCrunch",
    "type": "Business"
  },
  {
    "title": "Nancy Pelosi beat the market by 581%: Here are her 5 biggest wins and what you can learn from each one - Yahoo Finance",
    "description": "Her generational run has inspired the PELOSI Act, which aims to prevent politicians from trading in the future.",
    "url": "https://finance.yahoo.com/news/nancy-pelosi-beat-market-581-162100416.html",
    "source": "Yahoo Entertainment",
    "type": "Business"
  },
  {
    "title": "Shocking jobs data resets recession bets - TheStreet",
    "description": "Challenger, Gray, & Christmas see a jobs market hindered by softening consumer and corporate spending.",
    "url": "https://www.thestreet.com/employment/shocking-jobs-data-resets-recession-bets",
    "source": "TheStreet",
    "type": "Business"
  },
  {
    "title": "How Are We Gonna Pay for This? - The Wall Street Journal",
    "description": null,
    "url": "https://www.wsj.com/tech/ai/how-are-we-gonna-pay-for-this-8966c7c3",
    "source": "The Wall Street Journal",
    "type": "Business"
  },
  {
    "title": "This is the 'biggest mistake' you can make with your IRA, attorney says - CNBC",
    "description": "Many investors have significant wealth in their IRAs, and beneficiary designations, which dictate who receives the accounts after you die, can be overlooked.",
    "url": "https://www.cnbc.com/2025/11/09/biggest-ira-mistake.html",
    "source": "CNBC",
    "type": "Business"
  },
  {
    "title": "Why China will Rule Renewable Energy - Paul Krugman | Substack",
    "description": "And why it matters in an era of great-power rivalry",
    "url": "https://paulkrugman.substack.com/p/why-china-will-rule-renewable-energy",
    "source": "Substack.com",
    "type": "Business"
  },
  {
    "title": "After selling his business for $532 million, this millennial says a life of leisure was surprisingly ‘boring’, so he’s choosing to back to work - Yahoo",
    "description": "EXCLUSIVE: Wingstop UK’s cofounder went from hauling bricks for $5 an hour to building a $532 million business. It sounds like the rags-to-riches dream. But ...",
    "url": "https://www.yahoo.com/lifestyle/articles/selling-business-532-million-millennial-105700842.html",
    "source": "Yahoo Entertainment",
    "type": "Business"
  },
  {
    "title": "Blue collar is in. 10 high-paying jobs that don't require a degree. - USA Today",
    "description": "Blue-collar jobs are in. Here are 10 high-paying fields that don't require a college degree.",
    "url": "https://www.usatoday.com/story/money/2025/11/09/high-paying-jobs-no-college-degree/87128956007/",
    "source": "USA Today",
    "type": "Business"
  },
  {
    "title": "Goldman Sachs says we’re not in an AI bubble, and its young multimillionaire clientele are all-in on AI-energy investments and healthcare innovations - Fortune",
    "description": "Goldman Sachs brought together 100 ultra-rich clientele at its annual At the Helm summit—and AI was the talk of the town.",
    "url": "https://fortune.com/2025/11/09/goldman-sachs-not-in-ai-bubble-young-mutlimillionaire-clients-ai-energy-investments-healthcare/",
    "source": "Fortune",
    "type": "Business"
  },
  {
    "title": "China consumer prices return to growth in October, producer price slump extends to three years - CNBC",
    "description": "Deflation in China eased in October, as consumer prices returned to growth after falling for two straight months, though producer prices extended their slump to three years.",
    "url": "https://www.cnbc.com/2025/11/09/china-october-cpi-ppi-deflation-consumer-prices-.html",
    "source": "CNBC",
    "type": "Business"
  },
  {
    "title": "ByHeart baby formula recalled amid 10-state outbreak of infant botulism - NBC News",
    "description": "A maker of organic baby formula is recalling some of the product after federal officials linked it to a 10-state infant botulism outbreak",
    "url": "https://www.nbcnews.com/health/recall/byheart-baby-formula-recalled-state-outbreak-infant-botulism-rcna242783",
    "source": "NBC News",
    "type": "Business"
  },
  {
    "title": "Merck’s pill to reduce cholesterol on top of statins matches results from injectables - statnews.com",
    "description": "Merck's enlicitide pill lowered LDL cholesterol by up to 60%, matching injectables like Repatha and offering an easier option for patients.",
    "url": "https://www.statnews.com/2025/11/08/merck-enlicitide-cholesterol-pill-study-results/",
    "source": "STAT",
    "type": "Business"
  },
  {
    "title": "FBI investigates tourist’s death on cruise ship arriving at PortMiami - WPLG Local 10",
    "description": "FBI special agents were investigating the death of a Carnival Cruise Lines passenger aboard a ship that returned on Saturday to PortMiami.",
    "url": "https://www.local10.com//news/local/2025/11/08/fbi-investigates-tourists-death-on-cruise-ship-arriving-at-portmiami/",
    "source": "WPLG Local 10",
    "type": "Business"
  },
  {
    "title": "Arc Raiders breaks another concurrent record as player count soars - Eurogamer",
    "description": "Arc Raiders has once again smashed its own concurrent peak user count on Steam, topping 400,000 for the first time this…",
    "url": "https://www.eurogamer.net/arc-raiders-breaks-another-concurrent-record-as-player-count-soars",
    "source": "Eurogamer.net",
    "type": "Tech"
  },
  {
    "title": "Stalker 2 dev strikes down copycat game Misery with DMCA claim - Eurogamer",
    "description": "Stalker 2: Heart of Chornobyl developer GSC Game World has struck down co-op survival horror shooter Misery with a DMCA…",
    "url": "https://www.eurogamer.net/stalker-2-dev-strikes-down-copycat-game-misery-with-dmca-claim",
    "source": "Eurogamer.net",
    "type": "Tech"
  },
  {
    "title": "Dispatch Lead Developer Says The Team Will \"Think\" About Season 2 - TheGamer",
    "description": "Season 1 isn't even over yet, but more Dispatch seems inevitable.",
    "url": "https://www.thegamer.com/dispatch-adhoc-studios-co-founder-says-team-is-thinking-about-season-2/",
    "source": "TheGamer",
    "type": "Tech"
  },
  {
    "title": "Apple reportedly plans ambitious satellite-powered iPhone features - TechCrunch",
    "description": "While Apple’s iPhone already supports texting, calling emergency services, and contacting roadside assistance via satellite connectivity, the company may have many more satellite-powered features in the works.",
    "url": "https://techcrunch.com/2025/11/09/apple-reportedly-plans-ambitious-satellite-powered-iphone-features/",
    "source": "TechCrunch",
    "type": "Tech"
  },
  {
    "title": "Massive Red Dead Redemption 2 mod “Nuevo Paraíso” recreates RDR1’s Mexico with expanded world and missions - Notebookcheck",
    "description": "A new large-scale mod for Red Dead Redemption 2 titled Nuevo Paraíso – The Forgotten Frontier has been unveiled, aiming to expand the game’s world by reintroducing Mexico, the long-missing region from Red Dead Redemption 1. The fan project is described as a b…",
    "url": "https://www.notebookcheck.net/Massive-Red-Dead-Redemption-2-mod-Nuevo-Paraiso-recreates-RDR1-s-Mexico-with-expanded-world-and-missions.1159232.0.html",
    "source": "Notebookcheck.net",
    "type": "Tech"
  },
  {
    "title": "The little known Android keyboard shortcut I use every single day - Android Police",
    "description": "Typing feels incomplete without it",
    "url": "https://www.androidpolice.com/android-keyboard-shortcut-i-use-every-single-day/",
    "source": "Android Police",
    "type": "Tech"
  },
  {
    "title": "Gemini has made Google Home incredibly smart, except for the dumb mistakes - 9to5Google",
    "description": "Gemini for Google Home has arrived and, with it, a glimpse of Google’s view of the future of the smart...",
    "url": "http://9to5google.com/2025/11/09/gemini-google-home-impressions/",
    "source": "9to5google.com",
    "type": "Tech"
  },
  {
    "title": "Mechanic goes to work on 1968 Mustang GT 390 4-Speed before making startling realization about the car - supercarblondie.com",
    "description": "This mechanic recently received a Mustang GT 390 to work on - before making an absolutely startling realization in the process",
    "url": "https://supercarblondie.com/mechanic-1968-mustang-gt-390-4-speed-startling-realization/",
    "source": "Supercarblondie.com",
    "type": "Tech"
  },
  {
    "title": "Kingdom Come: Deliverance 2 Veteran Joins The Witcher 4 Team - Game Rant",
    "description": "A Warhorse Studios veteran who held several senior roles on Kingdom Come: Deliverance 2 joins The Witcher 4 team in a key position.",
    "url": "https://gamerant.com/witcher-4-kingdom-come-deliverance-sr-quest-designer-dev-karel-kolmann/",
    "source": "GameRant",
    "type": "Tech"
  },
  {
    "title": "The tale of the Fire Phone, Amazon’s very strange smartphone - The Verge",
    "description": "With a 3D screen, a lot of cameras, and some big ideas about smartphones, Amazon came roaring into the mobile game in 2014. By the end of the year, it was over.",
    "url": "https://www.theverge.com/podcast/816739/amazon-fire-phone-version-history",
    "source": "The Verge",
    "type": "Tech"
  },
  {
    "title": "You Can Use Your Old TV As A Smart Mirror - Here's How - bgr.com",
    "description": "When you get a new TV, there's a great use for your old one. Using Raspberry Pi, Magic Mirror, and some materials, you can turn it into a smart mirror.",
    "url": "https://www.bgr.com/2014813/how-to-turn-old-tv-into-smart-mirror-raspberry-pi-guide/",
    "source": "BGR",
    "type": "Tech"
  },
  {
    "title": "Deck out your tree with ornaments of retro consoles, movie moments, and more - The Verge",
    "description": "You could put plain ornaments on your tree, but we’ve found some great alternatives that tap into nostalgia and nerd culture.",
    "url": "https://www.theverge.com/tech/811614/best-christmas-ornaments-2025",
    "source": "The Verge",
    "type": "Tech"
  },
  {
    "title": "Shigeru Miyamoto discusses his current involvement with Mario games and more - Nintendo Everything",
    "description": "Nintendo's Shigeru Miyamoto talks about his current involvement with Mario games and other topics in a new interview.",
    "url": "https://nintendoeverything.com/shigeru-miyamoto-discusses-his-current-involvement-with-mario-games-and-more/",
    "source": "Nintendoeverything.com",
    "type": "Tech"
  },
  {
    "title": "The Linux Kernel Looks To \"Bite The Bullet\" In Enabling Microsoft C Extensions - Phoronix",
    "description": "Two patches queued into the Linux kernel's build system development tree, kbuild-next, would enable the -fms-extensions compiler argument everywhere for allowing GCC and LLVM/Clang to use the Microsoft C Extensions when compiling the Linux kernel",
    "url": "https://www.phoronix.com/news/Linux-6.19-Patch-Would-MS-Ext",
    "source": "Phoronix",
    "type": "Tech"
  },
  {
    "title": "Arc Raiders - All Enemies And How To Kill Them - GameSpot",
    "description": "Here's every ARC in the game so far and how to take them down.",
    "url": "https://www.gamespot.com/articles/arc-raiders-all-enemies-and-how-to-kill-them/1100-6536073/",
    "source": "GameSpot",
    "type": "Tech"
  },
  {
    "title": "65daysofstatic’s new No Man’s Sky album searches for humanity in an AI-filled world - The Verge",
    "description": "65daysofstatic, the band behind the No Man’s Sky soundtrack, has returned to the game with a new album called Journeys.",
    "url": "https://www.theverge.com/report/816427/no-mans-sky-album-journeys-65daysofstatic",
    "source": "The Verge",
    "type": "Tech"
  },
  {
    "title": "I set up a free system monitor that actually tells me why my PC is slow - MakeUseOf",
    "description": "Discover the advanced Windows utility that uncovers hidden causes behind performance issues and lags.",
    "url": "https://www.makeuseof.com/set-up-free-system-monitor-that-tells-me-why-pc-slow/",
    "source": "MakeUseOf",
    "type": "Tech"
  },
  {
    "title": "Adobe Firefly Is the Best-Kept Secret in Generative AI. Here’s How to Use It - WIRED",
    "description": "Adobe Firefly is a deceptively powerful AI playground to generate images, videos, and more. Here’s how to make the most of it.",
    "url": "https://www.wired.com/story/what-is-adobe-firefly/",
    "source": "Wired",
    "type": "Tech"
  }
]